package ru.practicum;

public class Tests {
    /* 1. Реализовать юнит-тесты для всего кода, содержащего логику.
    Выберите те классы, которые содержат в себе нетривиальные методы, условия и ветвления.
    В основном это будут классы сервисов. Напишите юнит-тесты на все такие методы, используя моки при необходимости.

    2. Реализовать интеграционные тесты, проверяющие взаимодействие с базой данных.
    Мы предлагаем вам создать по одному интеграционному тесту для каждого крупного метода в ваших сервисах.
    Например, для метода getUserItems в классе ItemServiceImpl.

    3. Реализовать тесты для REST-эндпоинтов вашего приложения с использованием MockMVC.
    Вам нужно покрыть тестами все существующие эндпоинты. При этом для слоя сервисов используйте моки.

    4. Реализовать тесты для слоя репозиториев вашего приложения с использованием аннотации @DataJpaTest.
    Есть смысл написать тесты для тех репозиториев, которые содержат кастомные запросы.
    Работа с аннотацией @DataJpaTest не рассматривалась подробно в уроке, поэтому вам предстоит изучить пример самостоятельно.

    5. Реализовать тесты для работы с JSON для DTO в вашем приложении с помощью аннотации @JsonTest.
    Такие тесты имеют смысл в тех случаях, когда ваши DTO содержат в себе некоторую логику.
    Например, описание формата дат или валидацию. Выберите DTO, где есть подобные условия, и напишите тесты.*/
}
